nxp-mcuxpresso/mcuxsdk-examples/_boards/evk9mimx8ulp/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void) {                             /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTA16_CAN0_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA17_CAN0_RX, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDAC0Pins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: cm33}
- pin_list:
  - {pin_num: C9, peripheral: DAC0, signal: dac_out, pin_signal: DAC0_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDAC0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDAC0Pins(void) {                            /*!< Function assigned for the core: Cortex-M33[cm33] */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: A9, peripheral: FXIO0, signal: 'fxio_d, 16', pin_signal: PTB0, PS: UP, PE: ENABLED, SRE: SLOW, ODE: OPEN_DRAIN, DSE: HIDRIVE}
  - {pin_num: B10, peripheral: FXIO0, signal: 'fxio_d, 17', pin_signal: PTB1, PS: UP, PE: ENABLED, SRE: SLOW, ODE: OPEN_DRAIN, DSE: HIDRIVE}
  - {pin_num: F6, peripheral: FXIO0, signal: 'fxio_d, 0', pin_signal: PTA8}
  - {pin_num: E5, peripheral: FXIO0, signal: 'fxio_d, 1', pin_signal: PTA9}
  - {pin_num: D12, peripheral: FXIO0, signal: 'fxio_d, 18', pin_signal: PTB2, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: A11, peripheral: FXIO0, signal: 'fxio_d, 19', pin_signal: PTB3, SRE: SLOW, DSE: HIDRIVE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIOPins(void) {                          /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTA8_FXIO0_D0, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA9_FXIO0_D1, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTB0_FXIO0_D16, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB0_FXIO0_D16,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_ODE_MASK |
                        IOMUXC_PCR_SRE_MASK |
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB1_FXIO0_D17, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB1_FXIO0_D17,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_ODE_MASK |
                        IOMUXC_PCR_SRE_MASK |
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB2_FXIO0_D18, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB2_FXIO0_D18,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB3_FXIO0_D19, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB3_FXIO0_D19,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33}
- pin_list:
  - {pin_num: D24, peripheral: FLEXSPI1, signal: flexspi_a_ss0_b, pin_signal: PTC17, DSE: HIDRIVE}
  - {pin_num: C25, peripheral: FLEXSPI1, signal: flexspi_a_sclk, pin_signal: PTC18, DSE: HIDRIVE}
  - {pin_num: A23, peripheral: FLEXSPI1, signal: flexspi_a_dqs, pin_signal: PTC12, PS: DOWN, PE: ENABLED, DSE: HIDRIVE}
  - {pin_num: D22, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 7', pin_signal: PTC13, DSE: HIDRIVE}
  - {pin_num: B24, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 6', pin_signal: PTC14, DSE: HIDRIVE}
  - {pin_num: A25, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 5', pin_signal: PTC15, DSE: HIDRIVE}
  - {pin_num: F22, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 4', pin_signal: PTC16, DSE: HIDRIVE}
  - {pin_num: D26, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 3', pin_signal: PTC19, DSE: HIDRIVE}
  - {pin_num: B26, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 2', pin_signal: PTC20, DSE: HIDRIVE}
  - {pin_num: F24, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 1', pin_signal: PTC21, DSE: HIDRIVE}
  - {pin_num: E25, peripheral: FLEXSPI1, signal: 'flexspi_a_data, 0', pin_signal: PTC22, DSE: HIDRIVE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitXSPI1Pins(void) {                           /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTC12_FLEXSPI1_A_DQS, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC12_FLEXSPI1_A_DQS,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC13_FLEXSPI1_A_DATA7, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC13_FLEXSPI1_A_DATA7,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC14_FLEXSPI1_A_DATA6, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC14_FLEXSPI1_A_DATA6,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC15_FLEXSPI1_A_DATA5, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC15_FLEXSPI1_A_DATA5,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC16_FLEXSPI1_A_DATA4, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC16_FLEXSPI1_A_DATA4,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC17_FLEXSPI1_A_SS0_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC17_FLEXSPI1_A_SS0_B,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC18_FLEXSPI1_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC18_FLEXSPI1_A_SCLK,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC19_FLEXSPI1_A_DATA3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC19_FLEXSPI1_A_DATA3,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC20_FLEXSPI1_A_DATA2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC20_FLEXSPI1_A_DATA2,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC21_FLEXSPI1_A_DATA1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC21_FLEXSPI1_A_DATA1,
                        IOMUXC_PCR_DSE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTC22_FLEXSPI1_A_DATA0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTC22_FLEXSPI1_A_DATA0,
                        IOMUXC_PCR_DSE_MASK);
}


